/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidParameter" = "Invalid parameter.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationCode" = "Invalid operation code.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCommunicationManagerError" = "Could not connect to the server. Check the login data.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorUserAlreadyLoggedIn" = "User already logged in.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationExecutionInProgress" = "Operation execution is already in progress.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationContext" = "Invalid operation context.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidCommunicatorId" = "Invalid id for communication protocol.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidActionItemId" = "Invalid action item id.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCouldNotDecideCommunicator" = "Could not determine communication protocol.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidBackendPassword" = "Check your password.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorDeviceAlreadyRegistered" = "This device is already registered to a different user.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorPasswordsNotEqual" = "The passcodes you entered do not match.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationNotAllowed" = "The operation is not allowed in this state.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidServerHost" = "The login data you entered is insufficient or invalid. Try again.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorResetErrorCheckNetwork" = "Could not reset the app. Check whether you are connected to the network.";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckLoginData" = "Could not connect to the server. Check the login data.";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckUsernamePassword" = "Check your user name and password.";

/* XMSG */
"keyErrDescrMAFLogonErrorConsultWithAdministrator" = "Could not connect to the server. Consult with the administrator.";

/* XMSG */
"keyErrDescrMAFLogonErrorInvalidLoginData" = "The login data you entered is insufficient or invalid. Try again.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeCorrect" = "Enter the correct passcode.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDigit" = "Enter a passcode that contains at least one digit.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDontMatch" = "The passcodes you entered do not match.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeExpired" = "The passcode has expired. You have to change it.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLength" = "Enter a passcode with at least {0} characters.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLowercase" = "Enter a passcode that contains at least one lowercase letter.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeSpecialCharacters" = "Enter a passcode that contains at least one special character.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUniqueCharacters" = "Enter a passcode that contains at least {0} unique characters.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUppercase" = "Enter a passcode that contains at least one uppercase letter.";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateKeyGeneration" = "Could not get key for certificate.";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateGeneration" = "Could not get certificate.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorUnknown" = "Unknown error";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorAlreadyExists" = "Secure store already exists";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDataTypeError" = "DataType error";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDoesNotExist" = "Secure store does not exist";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidArg" = "Invalid argument";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidPassword" = "Enter the correct passcode.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorLocked" = "Secure store is locked";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorOutOfMemory" = "Secure store is out of memory";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordExpired" = "The passcode has expired. You have to change it.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequired" = "Enter a passcode that contains at least {0} unique characters.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresDigit" = "Enter a passcode that contains at least one digit.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresLower" = "Enter a passcode that contains at least one lowercase character.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresSpecial" = "Enter a passcode that contains at least one special character.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresUpper" = "Enter a passcode that contains at least one uppercase character.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinLength" = "Enter a passcode with at least {0} characters.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinUniqueChars" = "Enter a passcode that contains at least {0} unique characters.";

/* XMSG */
"keyErrDescrMAFSecureStoreManagerErrorDeleted" = "Secure store is deleted.";

/* XMSG */
"keyErrDescrMAFLogonErrorOperationNotSupported" = "Operation not supported.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidMCIMSSOPin" = "Invalid SSO Passcode.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorAfariaInvalidCredentials" = "Invalid Afaria credentials.";

